; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_1 ?v3 - type_1 ?v5 - type_2)
 	      (pred_3 ?v1 - object ?v5 - type_2)
	      (pred_2 ?v3 - type_1 ?v2 - type_3)
	      (pred_4 ?v3 - type_1 ?v1 - object ?v2 - type_3))

   (:action op_3
       :parameters  (?v3 - type_1 ?v7 ?v4 - type_2)
       :precondition (and  (pred_1 ?v3 ?v7))
       :effect (and  (pred_1 ?v3 ?v4)
		     (not (pred_1 ?v3 ?v7))))

   (:action op_1
       :parameters (?v3 - type_1 ?v6 - object ?v8 - type_2 ?v2 - type_3)
       :precondition  (and  (pred_3 ?v6 ?v8) (pred_1 ?v3 ?v8) (pred_2 ?v3 ?v2))
       :effect (and (pred_4 ?v3 ?v6 ?v2)
		    (not (pred_3 ?v6 ?v8)) 
		    (not (pred_2 ?v3 ?v2))))

   (:action op_2
       :parameters (?v3 - type_1 ?v6 - object ?v8 - type_2 ?v2 - type_3)
       :precondition  (and  (pred_4 ?v3 ?v6 ?v2) (pred_1 ?v3 ?v8))
       :effect (and (pred_3 ?v6 ?v8)
		    (pred_2 ?v3 ?v2)
		    (not (pred_4 ?v3 ?v6 ?v2)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_01 - type_1
obj_03 obj_05 - type_3
obj_10 obj_02 obj_04 obj_09 - type_2
obj_06 obj_07 obj_08 - object)
(:init
(pred_1 obj_01 obj_02)
(pred_2 obj_01 obj_03)
(pred_2 obj_01 obj_05)
(pred_3 obj_06 obj_04)
(pred_3 obj_07 obj_09)
(pred_3 obj_08 obj_09)
)
(:goal
(and
(pred_3 obj_06 obj_02)
(pred_3 obj_07 obj_10)
(pred_3 obj_08 obj_04)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_01 ?b obj_05))))
)
)

; plan
1. (op_3 obj_01 obj_02 obj_04)
   deleted: (pred_1 obj_01 obj_02)
   added: (pred_1 obj_01 obj_04)
   goals met: 0 of 3
2. (op_1 obj_01 obj_06 obj_04 obj_03)
   deleted: (pred_3 obj_06 obj_04) (pred_2 obj_01 obj_03)
   added: (pred_4 obj_01 obj_06 obj_03)
   goals met: 0 of 3
3. (op_3 obj_01 obj_04 obj_02)
   deleted: (pred_1 obj_01 obj_04)
   added: (pred_1 obj_01 obj_02)
   goals met: 0 of 3
4. (op_2 obj_01 obj_06 obj_02 obj_03)
   deleted: (pred_4 obj_01 obj_06 obj_03)
   added: (pred_3 obj_06 obj_02) (pred_2 obj_01 obj_03)
   goals met: 1 of 3
5. (op_3 obj_01 obj_02 obj_09)
   deleted: (pred_1 obj_01 obj_02)
   added: (pred_1 obj_01 obj_09)
   goals met: 1 of 3
6. (op_1 obj_01 obj_07 obj_09 obj_03)
   deleted: (pred_3 obj_07 obj_09) (pred_2 obj_01 obj_03)
   added: (pred_4 obj_01 obj_07 obj_03)
   goals met: 1 of 3
7. (op_3 obj_01 obj_09 obj_10)
   deleted: (pred_1 obj_01 obj_09)
   added: (pred_1 obj_01 obj_10)
   goals met: 1 of 3
8. (op_2 obj_01 obj_07 obj_10 obj_03)
   deleted: (pred_4 obj_01 obj_07 obj_03)
   added: (pred_3 obj_07 obj_10) (pred_2 obj_01 obj_03)
   goals met: 2 of 3
9. (op_3 obj_01 obj_10 obj_09)
   deleted: (pred_1 obj_01 obj_10)
   added: (pred_1 obj_01 obj_09)
   goals met: 2 of 3
10. (op_1 obj_01 obj_08 obj_09 obj_03)
   deleted: (pred_3 obj_08 obj_09) (pred_2 obj_01 obj_03)
   added: (pred_4 obj_01 obj_08 obj_03)
   goals met: 2 of 3
11. (op_3 obj_01 obj_09 obj_04)
   deleted: (pred_1 obj_01 obj_09)
   added: (pred_1 obj_01 obj_04)
   goals met: 2 of 3
12. (op_2 obj_01 obj_08 obj_04 obj_03)
   deleted: (pred_4 obj_01 obj_08 obj_03)
   added: (pred_3 obj_08 obj_04) (pred_2 obj_01 obj_03)
   goals met: 3 of 3
